# Brewfile - Extended 2025 Developer Setup

# -----------------------
# Command-line tools
# -----------------------
brew "git"              # Version control
brew "git-town"         # Git workflow automation tool
brew "node"             # JavaScript runtime
brew "python@3.12"      # Python language
brew "php"              # PHP latest (for future upgrade)
brew "htop"             # Interactive process viewer
brew "wget"             # Download files from the web
brew "tree"             # Directory tree visualization
brew "jq"               # JSON processing in CLI
brew "tmux"             # Terminal multiplexer
brew "gh"               # GitHub CLI
brew "codex"            # OpenAI Codex CLI
brew "fd"               # Faster alternative to 'find'
brew "ripgrep"          # Super fast search tool
brew "bat"              # Improved 'cat' with syntax highlighting
brew "eza"              # Modern 'ls' replacement
brew "dockutil"         # Manage Dock items
brew "mas"              # Mac App Store CLI

# -----------------------
# GUI applications
# -----------------------
cask "visual-studio-code"   # Code editor
cask "cursor"               # AI code assistant (Cursor)
cask "kiro"                 # Agentic IDE for spec-driven development
cask "sublime-text"	        # Lightweight code editor
cask "docker"               # Containerization platform
cask "virtualbox"           # Virtual machine platform
cask "iterm2"               # Enhanced terminal
cask "postman"              # API testing tool
cask "transmit"             # FTP/SFTP client
cask "tableplus"            # Database GUI (Supports more DB types)
cask "sequel-ace"           # Lightweight Database GUI
cask "microsoft-office"     # Office suite (Word, Excel, etc.)
cask "libreoffice"          # Free office suite alternative
# cask "microsoft-teams"    # New Teams client (free + work/school)
cask "slack"                # Team communication
#cask "notion"              # Notes & project management
cask "spotify"              # Music streaming
cask "google-chrome"        # Browser
cask "arc"                  # Arc browser by The Browser Company
cask "dropbox"              # Cloud storage
cask "whatsapp"             # Messaging app
cask "chatgpt"              # OpenAI ChatGPT desktop app

# -----------------------
# Utilities & productivity
# -----------------------
cask "rectangle"            # Window management (keyboard shortcuts for arranging windows)
cask "alacritty"            # Alternative terminal (GPU accelerated)
cask "font-fira-code"       # Developer font with ligatures
cask "zoom"                 # Video calls
cask "teamviewer"           # Remote desktop access
cask "obsidian"             # Markdown note-taking & knowledge management
#cask "figma"               # UI/UX design tool
cask "hazel"                # Automated file management (rules)
cask "karabiner-elements"   # Keyboard remapping & custom shortcuts
#cask "raycast"             # Powerful Spotlight alternative with extensions
#cask "vlc"                 # Media player
#cask "1password"           # Password manager
cask "tailscale-app"        # Tailscale GUI – VPN based on WireGuard

# -----------------------
# Network & backup tools
# -----------------------
brew "nmap"                 # Network scanner
brew "speedtest-cli"        # Test internet speed from CLI
brew "rsync"                # Backup & sync tool
brew "aria2"                # Advanced download utility

# -----------------------
# App Store applications via mas (Mac App Store CLI)
# -----------------------
# WhatsApp can be installed via the App Store using mas
#mas "WhatsApp", id: 1147396723

# -----------------------
# Notes
# -----------------------
# - 'microsoft-auto-update' is installed automatically with Microsoft apps
#   (Word, Excel, Teams, etc.) and doesn't need to be listed explicitly.
